package com.perfect.bcs.biz;

import com.google.common.collect.Lists;
import java.util.List;
import org.apache.commons.lang3.RandomUtils;

public class MockDataUtil {

    /**
     * 姓氏大全列表
     */
    public static List<String> getSurnameList() {
        String[] surname = { "怀", "老", "堂", "考", "逄", "栋", "闻人", "树", "栗", "候", "通", "速", "校", "逢", "性",
                             "倪", "逮", "逯",
                             "堵", "栾", "耿", "桂", "聂", "衅", "遇", "聊", "行", "桐", "桑", "桓", "道", "塔", "硕",
                             "塞", "衡", "衣", "桥", "令狐", "表",
                             "恭", "偶", "衷", "项", "须", "恽", "顾", "顿", "袁", "梁", "漆雕", "东欧", "傅", "梅",
                             "肇", "悉", "夏侯", "频", "邓", "邗", "邛",
                             "颜", "邝", "悟", "邢", "那", "肥", "碧", "储", "墨", "邬", "袭", "邰", "邱", "邴", "邵",
                             "邶", "邸", "邹", "检", "郁", "郎",
                             "风", "郏", "郑", "裔", "郗", "裘", "郜", "郝", "飞", "烟", "惠", "胡", "胥", "郦", "第五",
                             "僧", "磨", "僪", "士", "壬", "郭",
                             "钟离", "森", "郯", "声", "裴", "郸", "能", "都", "鄂", "愈", "焉", "植", "夏", "褒", "夔",
                             "夕", "夙", "褚", "多", "愚", "鄞",
                             "鄢", "焦", "大", "天", "夫", "脱", "夷", "示", "礼", "祁", "允", "元", "充", "酆", "兆",
                             "奇", "祈", "奈", "慈", "奉", "光",
                             "慎", "段干", "酒", "慕", "奕", "祖", "奚", "党", "楚", "祝", "祢", "全", "公", "祭", "六",
                             "兰", "关", "兴", "饶", "其", "典",
                             "养", "楼", "腾", "冀", "覃", "禄", "冉", "熊", "福", "冒", "首", "禚", "军", "农", "妫",
                             "冯", "况", "冷", "禹", "冼", "禽",
                             "禾", "释", "秋", "始", "凌", "种", "野", "金", "姒", "姓", "委", "燕", "秘", "姚", "姜",
                             "解", "凤", "秦", "臧", "巫马", "姬",
                             "凭", "呼延", "称", "出", "函", "言", "刀", "刁", "威", "娄", "舄", "戈", "樊", "戊", "程",
                             "戎", "税", "戏", "成", "刑", "舒",
                             "夹谷", "端木", "刘", "战", "戚", "刚", "舜", "初", "戢", "利", "别", "爱", "戴", "步都",
                             "户", "稽", "訾", "房", "所", "穆", "扈",
                             "前", "才", "剑", "牛", "牟", "牢", "牧", "剧", "马", "扬", "良", "穰", "牵", "扶", "詹",
                             "驹", "空", "艾", "承", "檀", "犁",
                             "节", "抄", "骆", "司徒", "骑", "芒", "抗", "折", "力", "功", "务", "窦", "芮", "仲孙",
                             "花", "万俟", "励", "劳", "犹", "势", "狂",
                             "狄", "勇", "苌", "苍", "苏", "苑", "苗", "高", "招", "拜", "苟", "章", "勤", "童", "苦",
                             "宇文", "独", "竭", "端", "拱", "英",
                             "竹", "竺", "勾", "百里", "茂", "范", "笃", "茅", "包", "茆", "謇", "欎", "荔菲", "东方",
                             "化", "北", "匡", "次", "符", "笪", "第",
                             "嬴", "茹", "辗迟", "区", "谷梁", "微生", "南宫", "荀", "千", "荆", "东门", "华", "魏",
                             "卑", "卓", "孔", "答", "单", "字", "南",
                             "孙", "澹台", "孛", "卜", "孝", "卞", "孟", "占", "卢", "止", "季", "荣", "荤", "步", "武",
                             "学", "歧", "卫", "卯", "印", "危",
                             "却", "捷", "卷", "卿", "简", "宁", "玄", "宇", "守", "安", "厉", "玉", "王", "宋", "掌",
                             "完", "厍", "宏", "宓", "公羊", "箕",
                             "宗", "莘", "官", "定", "厚", "宛", "宜", "宝", "实", "原", "计", "管", "宣", "接", "宦",
                             "让", "莫", "宫", "环", "宰", "莱",
                             "殳", "殴", "段", "家", "殷", "许", "容", "宿", "菅", "寇", "及", "毋", "空曾", "友", "富",
                             "双", "羊舌", "母", "寒", "毓", "锺离",
                             "叔", "毕", "受", "诗", "毛", "古", "召", "班", "揭", "可", "台", "史", "说", "叶", "诸",
                             "司", "寸", "诺", "寻", "寿", "封",
                             "将", "理", "谈", "合", "吉", "尉", "濮阳", "同", "谌", "后", "谏", "向", "少", "尔", "吕",
                             "尚", "谢", "尤", "营", "琦", "萧",
                             "尧", "萨", "谬", "谭", "谯", "吴", "水", "琴", "谷", "永", "尹", "尾", "吾", "局", "求",
                             "居", "豆", "屈", "汉", "告", "籍",
                             "展", "汗", "西门", "员", "葛", "汝", "瑞", "江", "屠", "池", "象", "董", "汤", "周", "摩",
                             "汪", "山", "汲", "米", "类", "鱼",
                             "呼", "鲁", "沃", "宗政", "沈", "针", "蒉", "钊", "貊", "蒋", "和", "鲍", "宰父", "咎",
                             "沐", "岑", "撒", "粘", "蒙", "沙", "鲜",
                             "钞", "钟", "粟", "钦", "璩", "钭", "钮", "蒯", "钱", "蒲", "岳", "咸", "蒿", "哀", "铁",
                             "哈", "泉", "操", "铎", "法", "糜",
                             "蓝", "蓟", "波", "泣", "泥", "蓬", "瓮", "泰", "银", "泷", "左丘", "系", "尉迟", "锁",
                             "甄", "崇", "慕容", "洋", "唐", "锐", "崔",
                             "甘", "错", "蔚", "洛", "贝", "生", "素", "蔡", "贡", "索", "用", "洪", "甫", "紫", "支",
                             "贯", "田", "贰", "唱", "由", "贲",
                             "甲", "申", "贵", "贸", "费", "改", "贺", "蔺", "贾", "资", "畅", "商", "嵇", "镇", "赏",
                             "敏", "浑", "拓跋", "赖", "敖", "留",
                             "赛", "敛", "镜", "轩辕", "鲜于", "赤", "浦", "赧", "赫", "敬", "浮", "赵", "海", "南门",
                             "司马", "蕾", "长", "涂", "申屠", "薄",
                             "善", "文", "司空", "越", "斋", "疏", "斐", "公西", "薛", "斛", "喜", "綦", "长孙", "斯",
                             "方", "喻", "梁丘", "於", "施", "公冶",
                             "旁", "旅", "藏", "单于", "旗", "无", "淡", "巢", "藤", "左", "淦", "巧", "门", "巨", "巩",
                             "藩", "闪", "巫", "闫", "闭", "问",
                             "路", "己", "闳", "巴", "闵", "时", "旷", "闻", "闽", "闾", "丁", "昂", "市", "布", "帅",
                             "清", "万", "师", "嘉", "昌", "颛孙",
                             "希", "不", "明", "阎", "丑", "易", "昔", "帖", "世", "壤驷", "丘", "阙", "丙", "阚", "业",
                             "丛", "帛", "东", "昝", "子车", "星",
                             "渠", "严", "春", "温", "席", "中", "阮", "是", "丰", "聂晁", "阳", "阴", "常", "游", "丹",
                             "阿", "陀", "晁", "繁", "陆", "蹇",
                             "陈", "么", "蹉", "义", "晋", "之", "乌", "虎", "晏", "乐", "乔", "乘", "乙", "湛", "东郭",
                             "乜", "九", "虞", "习", "虢", "书",
                             "普", "景", "买", "干", "平", "年", "陶", "幸", "智", "登", "白", "百", "乾", "广", "鹿",
                             "蚁", "庄", "隆", "庆", "皇", "公良",
                             "皋", "隋", "于", "随", "源", "隐", "云", "亓", "库", "应", "五", "井", "隗", "庚", "府",
                             "庞", "红", "亢", "亥", "度", "麦",
                             "暨", "纪", "京", "皮", "纳", "麴", "暴", "纵", "康", "庹", "麻", "隽", "庾", "线", "雀",
                             "仁", "练", "黄", "司寇", "集", "仆",
                             "仇", "上官", "终", "盈", "廉", "仉", "益", "介", "雍", "盍", "绍", "仍", "黎", "从", "经",
                             "滑", "滕", "廖", "盖", "盘", "付",
                             "仙", "盛", "仝", "回", "满", "代", "令", "以", "绪", "雪", "仪", "续", "蛮", "仰", "仲",
                             "曲", "绳", "仵", "淳于", "延", "零",
                             "雷", "相", "曹", "建", "任", "国", "曾", "开", "漆", "有", "伊", "朋", "伍", "霍", "伏",
                             "缑", "休", "弓", "弘", "乐正", "望",
                             "霜", "真", "伟", "张", "圣", "弥", "伦", "在", "缪", "漫", "本", "圭", "弭", "眭", "伯",
                             "朱", "朴", "凃肖", "强", "机", "似",
                             "权", "但", "位", "李", "齐", "归", "青", "何", "罕", "靖", "罗", "潘", "佘", "余", "坚",
                             "佛", "杜", "潜", "杞", "束", "佟",
                             "睢", "督", "彤", "来", "车", "睦", "公孙", "杨", "革", "亓官", "彭", "杭", "潭", "潮",
                             "诸葛", "靳", "佴", "佼", "载", "松", "板",
                             "澄", "辉", "羊", "皇甫", "律", "後", "融", "侍", "徐", "析", "林", "龙", "龚", "枚", "辛",
                             "辜", "枝", "依", "辟", "鞠", "御",
                             "侨", "徭", "侯", "德", "边", "羽", "达", "羿", "瞿", "翁", "赫连", "过", "闾丘", "俎",
                             "城", "柏", "运", "柔", "进", "保", "俞",
                             "连", "翟", "俟", "迟", "翠", "欧阳", "太叔", "信", "相查", "查", "韦", "翦", "韩", "矫",
                             "濮", "修", "迮", "柯", "濯", "柳", "石",
                             "柴", "念", "韶", "忻", "陕", "部", "凡", "肖", "欧" };
        return Lists.newArrayList(surname);
    }

    public static List<String> getFemaleList() {
        String[] name = { "洁", "霄", "娅", "月", "嘉", "眉", "伊", "希", "萍", "舒", "茗", "君", "娜", "茜", "思",
                          "霞", "贞", "娟", "真",
                          "素", "怡", "欢", "娣", "欣", "娥", "春", "琦", "锦", "倩", "琬", "昭", "霭", "琰", "爱",
                          "露", "琳", "娴", "琴", "丹", "琼",
                          "爽", "丽", "桂", "婉", "蕊", "华", "青", "晓", "荔", "婕", "瑗", "静", "瑞", "筠", "荣",
                          "慧", "彩", "聪", "兰", "影", "艳",
                          "佳", "婵", "晶", "瑶", "婷", "荷", "艺", "瑾", "卿", "宁", "梅", "薇", "玉", "莉", "妍",
                          "融", "美", "莎", "咏", "璐", "云",
                          "颖", "香", "岚", "亚", "媛", "澜", "宜", "芝", "枝", "红", "馥", "梦", "悦", "璧", "纨",
                          "馨", "枫", "芬", "环", "纯", "冰",
                          "玲", "莲", "育", "芳", "芸", "妹", "莺", "羽", "秀", "雁", "菁", "雅", "蓉", "菊", "珊",
                          "秋", "珍", "淑", "苑", "寒", "蓓",
                          "毓", "柔", "燕", "飘", "黛", "凝", "惠", "珠", "翠", "凡", "滢", "姣", "凤", "勤", "巧",
                          "雪", "仪", "姬", "园", "可", "英",
                          "菲", "韵", "叶", "竹" };
        return Lists.newArrayList(name);
    }

    public static List<String> getMaleList() {
        String[] name = { "言", "茂", "清", "震", "有", "朋", "栋", "昌", "明", "成", "民", "树", "世", "朗", "弘",
                          "刚", "会", "琛", "东",
                          "思", "伟", "生", "星", "鸣", "谦", "伦", "利", "天", "航", "中", "振", "伯", "启", "贵",
                          "永", "强", "政", "元", "奇", "先",
                          "义", "光", "之", "克", "行", "才", "鹏", "子", "乐", "策", "坚", "博", "江", "楠", "健",
                          "祥", "学", "武", "全", "晨", "浩",
                          "彪", "豪", "彬", "敬", "轮", "良", "杰", "山", "平", "兴", "海", "顺", "松", "腾", "广",
                          "承", "宁", "梁", "善", "超", "庆",
                          "文", "辉", "安", "和", "斌", "炎", "福", "宏", "榕", "林", "龙", "厚", "军", "力", "涛",
                          "功", "冠", "群", "邦", "钧", "亨",
                          "岩", "亮", "新", "辰", "河", "家", "康", "德", "达", "仁", "心", "雄", "毅", "勇", "俊",
                          "磊", "友", "富", "绍", "风", "发",
                          "翔", "裕", "志", "诚", "进", "盛", "胜", "保", "飞", "信", "波", "若", "以", "士", "旭",
                          "壮", "峰", "翰", "泰", "哲", "维",
                          "致", "时", "固", "建", "国", "泽" };
        return Lists.newArrayList(name);
    }

    public static String getName() {

        List<String> surnameList = getSurnameList();
        List<String> girl = getFemaleList();
        List<String> boy = getMaleList();

        // 获得一个随机的姓氏
        int index = RandomUtils.nextInt(0, surnameList.size());
        String name = surnameList.get(index);

        // 可以根据这个数设置产生的男女比例
        int i = RandomUtils.nextInt(0, 3);
        if (i == 2) {
            int j = RandomUtils.nextInt(0, girl.size() - 1);
            if (j % 2 == 0) {
                // 女
                name = name + girl.get(j) + girl.get(j + 1);
            } else {
                name = name + girl.get(j);
            }
        } else {
            int j = RandomUtils.nextInt(0, boy.size() - 1);
            // 男
            if (j % 2 == 0) {
                name = name + boy.get(j) + boy.get(j + 1);
            } else {
                name = name + boy.get(j);
            }
        }

        return name;
    }

}
